{"config": {"layers": [{"config": {"batch_input_shape": [null, 100], "input_dim": 431, "embeddings_constraint": null, "input_length": 100, "mask_zero": false, "embeddings_initializer": {"config": {"minval": 0, "maxval": null, "seed": null, "dtype": "float32"}, "class_name": "RandomUniform"}, "name": "embedding_1", "trainable": true, "output_dim": 32, "dtype": "float32", "embeddings_regularizer": null, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"batch_input_shape": [null, 100, 32], "filters": 64, "activity_regularizer": null, "strides": [1], "dtype": "float32", "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv1d_1", "bias_constraint": null, "trainable": true, "activation": "relu", "padding": "valid", "kernel_regularizer": null, "kernel_size": [3], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv1D"}, {"config": {"return_sequences": false, "recurrent_dropout": 0.0, "use_bias": true, "name": "lstm_1", "trainable": true, "activation": "tanh", "go_backwards": false, "kernel_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "activity_regularizer": null, "unroll": false, "implementation": 1, "stateful": false, "dropout": 0.0, "units": 128, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "activation": "relu", "dtype": "float32", "kernel_regularizer": null, "units": 40, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "bias_regularizer": null, "activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "units": 1, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}], "name": "sequential"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6-tf"}